
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзменитьВидимость();
КонецПроцедуры 
&НаКлиенте
Процедура ИзменитьВидимость()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.ОсновнойДоговор.Видимость = Ложь;
		Элементы.Наименование.Заголовок = "Ф.И.О. Клиента";
		Элементы.Источник.Видимость = Истина;
		Элементы.ДатаРождения.Видимость = Истина;
		Элементы.ПолКлиента.Видимость = Истина;
		Элементы.Питомцы.Видимость = Истина;
	Иначе 
		Элементы.ОсновнойДоговор.Видимость = Истина;
		Элементы.Наименование.Заголовок = "Наименование";
		Элементы.Источник.Видимость = Ложь;
		Элементы.ДатаРождения.Видимость = Ложь;
		Элементы.ПолКлиента.Видимость = Ложь; 
		Элементы.Питомцы.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	ИзменитьВидимость();
КонецПроцедуры
