
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьНомерДоговора(); 
	ПризнакДействияДоговора();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНомерДоговора()
	Если ЗначениеЗаполнено(Объект.НомерДоговораВнешний) ИЛИ ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование =  "№" + Объект.НомерДоговораВнешний + " " +  "от" +  " " + Формат(Объект.ДатаЗаключенияДоговора,"ДФ=dd.MM.yyyy"); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПризнакДействияДоговора()
	Если Объект.Бессрочный = Истина Тогда
		Элементы.СрокДействияДоговора.Видимость = Ложь;
	Иначе 
		Элементы.СрокДействияДоговора.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерДоговораВнешнийПриИзменении(Элемент)
	СформироватьНомерДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	СформироватьНомерДоговора();
КонецПроцедуры

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	ПризнакДействияДоговора();
КонецПроцедуры
