&НаКлиенте
Процедура ИзменитьФИО()
	Если ЗначениеЗаполнено(Объект.Фамилия) И ЗначениеЗаполнено(Объект.Имя) И ЗначениеЗаполнено(Объект.Отчество) Тогда
		Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
	ИначеЕсли ЗначениеЗаполнено(Объект.Фамилия) ИЛИ Объект.Имя Тогда
		Объект.Наименование = Объект.Фамилия + " " + Объект.Имя;
	Иначе 
		Объект.Наименование = ""; 
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ИзменитьФИО();
КонецПроцедуры


&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ИзменитьФИО();
КонецПроцедуры


&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ИзменитьФИО();
КонецПроцедуры



