&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		ИзменитьФИО(); 
	Иначе 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Сотрудник %1 уже есть в базе и менять его ФИО нельзя!",Объект.Наименование);
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура ИзменитьФИО()
	Если ЗначениеЗаполнено(Объект.Фамилия) И ЗначениеЗаполнено(Объект.Имя) И ЗначениеЗаполнено(Объект.Отчество) Тогда
		Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
	ИначеЕсли ЗначениеЗаполнено(Объект.Фамилия) ИЛИ Объект.Имя Тогда
		Объект.Наименование = Объект.Фамилия + " " + Объект.Имя;
	Иначе 
		Объект.Наименование = ""; 
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ИзменитьФИО();
КонецПроцедуры


&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ИзменитьФИО();
КонецПроцедуры


&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ИзменитьФИО();
КонецПроцедуры



